MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.h
/** @defgroup CCB_Exported_Functions_Group2 Reset function
  * @{
  */
void HAL_CCB_Reset(hal_ccb_handle_t *hccb);
/**
  * @}
  */

/** @defgroup CCB_Exported_Functions_Group3 Wrapping symmetric key functions
  * @{
  */
hal_status_t HAL_CCB_ECDSA_WrapSymmetricKey(hal_ccb_handle_t *hccb, const uint32_t *p_in_user_key,
                                            hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                            uint32_t *p_out_wrapped_user_key);

hal_status_t HAL_CCB_ECC_WrapSymmetricKey(hal_ccb_handle_t *hccb, const uint32_t *p_in_user_key,
                                          hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                          uint32_t *p_out_wrapped_user_key);
hal_status_t HAL_CCB_RSA_WrapSymmetricKey(hal_ccb_handle_t *hccb, const uint32_t *p_in_user_key,
                                          hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                          uint32_t *p_out_wrapped_user_key);
/**
  * @}
  */

/** @defgroup CCB_Exported_Functions_Group4 Process with software wrapping key functions
  * @{
  */
/* ECDSA operation */
hal_status_t HAL_CCB_ECDSA_SW_WrapPrivateKey(hal_ccb_handle_t *hccb,
                                             const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                             const uint8_t *p_in_clear_private_key,
                                             const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                             const uint32_t *p_in_wrapped_user_key,
                                             hal_ccb_ecdsa_key_blob_t *p_out_wrapped_private_key_blob);

hal_status_t HAL_CCB_ECDSA_SW_GenerateWrapPrivateKey(hal_ccb_handle_t *hccb,
                                                     const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                                     const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                                     const uint32_t *p_in_wrapped_user_key,
                                                     hal_ccb_ecdsa_key_blob_t *p_out_wrapped_private_key_blob);

hal_status_t HAL_CCB_ECDSA_SW_Sign(hal_ccb_handle_t *hccb, const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                   const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                   const uint32_t *p_in_wrapped_user_key,
                                   hal_ccb_ecdsa_key_blob_t *p_in_wrapped_private_key_blob, const uint8_t *p_in_hash,
                                   uint8_t hash_size, hal_ccb_ecdsa_sign_t *p_out_signature);

hal_status_t HAL_CCB_ECDSA_SW_ComputePublicKey(hal_ccb_handle_t *hccb,
                                               const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                               const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                               const uint32_t *p_in_wrapped_user_key,
                                               hal_ccb_ecdsa_key_blob_t *p_in_wrapped_private_key_blob,
                                               hal_ccb_ecc_point_t *p_out_public_key);

/* ECC operation */
hal_status_t HAL_CCB_ECC_SW_WrapPrivateKey(hal_ccb_handle_t *hccb,
                                           const hal_ccb_ecc_mul_curve_param_t *p_in_curve_param,
                                           const uint8_t *p_in_clear_private_key,
                                           const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                           const uint32_t *p_in_wrapped_user_key,
                                           hal_ccb_ecc_mul_key_blob_t *p_out_wrapped_private_key_blob);

hal_status_t HAL_CCB_ECC_SW_GenerateWrapPrivateKey(hal_ccb_handle_t *hccb,
                                                   const hal_ccb_ecc_mul_curve_param_t *p_in_curve_param,
                                                   const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                                   const uint32_t *p_in_wrapped_user_key,
                                                   hal_ccb_ecc_mul_key_blob_t *p_out_wrapped_private_key_blob);

hal_status_t HAL_CCB_ECC_SW_ComputeScalarMul(hal_ccb_handle_t *hccb,
                                             const hal_ccb_ecc_mul_curve_param_t *p_in_curve_param,
                                             const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                             const uint32_t *p_in_wrapped_user_key,
                                             hal_ccb_ecc_mul_key_blob_t *p_in_wrapped_private_key_blob,
                                             hal_ccb_ecc_point_t *p_in_point,
                                             hal_ccb_ecc_point_t *p_out_point);

/* RSA operation */
hal_status_t HAL_CCB_RSA_SW_WrapPrivateKey(hal_ccb_handle_t *hccb, const hal_ccb_rsa_param_t *p_in_param,
                                           const hal_ccb_rsa_clear_key_t *p_in_rsa_clear_private_key,
                                           const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                           const uint32_t *p_in_wrapped_user_key,
                                           hal_ccb_rsa_key_blob_t *p_out_wrapped_private_key_blob);

hal_status_t HAL_CCB_RSA_SW_ComputeModularExp(hal_ccb_handle_t *hccb, const hal_ccb_rsa_param_t *p_in_param,
                                              const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                              const uint32_t *p_in_wrapped_user_key,
                                              hal_ccb_rsa_key_blob_t *p_in_wrapped_private_key_blob,
                                              const uint8_t *p_in_operand, uint8_t *p_out_modular_exp);
/**
  * @}
  */

