MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.h
/** @defgroup CCB_Exported_Functions_Group5 Process with hardware wrapping key functions
  * @{
  */
/* ECDSA operation */
hal_status_t HAL_CCB_ECDSA_HW_WrapPrivateKey(hal_ccb_handle_t *hccb,
                                             const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                             const uint8_t *p_in_clear_private_key,
                                             hal_ccb_wrapping_hw_key_type_t wrapping_hw_key_type,
                                             hal_ccb_ecdsa_key_blob_t *p_out_wrapped_private_key_blob);

hal_status_t HAL_CCB_ECDSA_HW_GenerateWrapPrivateKey(hal_ccb_handle_t *hccb,
                                                     const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                                     hal_ccb_wrapping_hw_key_type_t wrapping_hw_key_type,
                                                     hal_ccb_ecdsa_key_blob_t *p_out_wrapped_private_key_blob);

hal_status_t HAL_CCB_ECDSA_HW_Sign(hal_ccb_handle_t *hccb, const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                   hal_ccb_wrapping_hw_key_type_t wrapping_hw_key_type,
                                   hal_ccb_ecdsa_key_blob_t *p_in_wrapped_private_key_blob, const uint8_t *p_in_hash,
                                   uint8_t hash_size, hal_ccb_ecdsa_sign_t *p_out_signature);

hal_status_t HAL_CCB_ECDSA_HW_ComputePublicKey(hal_ccb_handle_t *hccb,
                                               const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                               hal_ccb_wrapping_hw_key_type_t wrapping_hw_key_type,
                                               hal_ccb_ecdsa_key_blob_t *p_in_wrapped_private_key_blob,
                                               hal_ccb_ecc_point_t *p_out_public_key);

/* ECC operation */
hal_status_t HAL_CCB_ECC_HW_WrapPrivateKey(hal_ccb_handle_t *hccb,
                                           const hal_ccb_ecc_mul_curve_param_t *p_in_curve_param,
                                           const uint8_t *p_in_clear_private_key,
                                           hal_ccb_wrapping_hw_key_type_t wrapping_hw_key_type,
                                           hal_ccb_ecc_mul_key_blob_t *p_out_wrapped_private_key_blob);

hal_status_t HAL_CCB_ECC_HW_GenerateWrapPrivateKey(hal_ccb_handle_t *hccb,
                                                   const hal_ccb_ecc_mul_curve_param_t *p_in_curve_param,
                                                   hal_ccb_wrapping_hw_key_type_t wrapping_hw_key_type,
                                                   hal_ccb_ecc_mul_key_blob_t *p_out_wrapped_private_key_blob);

hal_status_t HAL_CCB_ECC_HW_ComputeScalarMul(hal_ccb_handle_t *hccb,
                                             const hal_ccb_ecc_mul_curve_param_t *p_in_curve_param,
                                             hal_ccb_wrapping_hw_key_type_t wrapping_hw_key_type,
                                             hal_ccb_ecc_mul_key_blob_t *p_in_wrapped_private_key_blob,
                                             hal_ccb_ecc_point_t *p_in_point,
                                             hal_ccb_ecc_point_t *p_out_point);

/* RSA operation */
hal_status_t HAL_CCB_RSA_HW_WrapPrivateKey(hal_ccb_handle_t *hccb, const hal_ccb_rsa_param_t *p_in_param,
                                           const hal_ccb_rsa_clear_key_t *p_in_rsa_clear_private_key,
                                           hal_ccb_wrapping_hw_key_type_t wrapping_hw_key_type,
                                           hal_ccb_rsa_key_blob_t *p_out_wrapped_private_key_blob);


hal_status_t HAL_CCB_RSA_HW_ComputeModularExp(hal_ccb_handle_t *hccb, const hal_ccb_rsa_param_t *p_in_param,
                                              hal_ccb_wrapping_hw_key_type_t wrapping_hw_key_type,
                                              hal_ccb_rsa_key_blob_t *p_in_wrapped_private_key_blob,
                                              const uint8_t *p_in_operand, uint8_t *p_out_modular_exp);
/**
  * @}
  */

/** @defgroup CCB_Exported_Functions_Group6 Peripheral State, Error functions
  * @{
  */
hal_ccb_state_t HAL_CCB_GetState(const hal_ccb_handle_t *hccb);
#if defined(USE_HAL_CCB_GET_LAST_ERRORS) && (USE_HAL_CCB_GET_LAST_ERRORS == 1)
uint32_t HAL_CCB_GetLastErrorCodes(const hal_ccb_handle_t *hccb);
#endif /* USE_HAL_CCB_GET_LAST_ERRORS */


#if defined(USE_HAL_CCB_USER_DATA) && (USE_HAL_CCB_USER_DATA == 1)
void HAL_CCB_SetUserData(hal_ccb_handle_t *hccb, const void *p_user_data);
const void *HAL_CCB_GetUserData(const hal_ccb_handle_t *hccb);
#endif /* (USE_HAL_CCB_USER_DATA) */
/**
  * @}
  */

/** @defgroup CCB_Exported_Functions_Group7 Static Inlines functions
  * @{
This section provides functions to manage CCB flags:
  - HAL_CCB_GetFlag()          :Return the state of a flag
  */
/** @brief  Check whether the specified CCB status flag is set or not.
  * @param  hccb Specifies the ccb handle
  * @param  flag Specifies the flag to check, this parameter can be one of the following values:
  *            @arg @ref HAL_CCB_FLAG_BUSY               CCB busy or PKA RAM is being cleared
                                                         following a peripheral reset
  *            @arg @ref HAL_CCB_TAMP_EVT_RNG            RNG TAMP Event flag
  *            @arg @ref HAL_CCB_TAMP_EVT_SAES           SAES TAMP Event flag
  *            @arg @ref HAL_CCB_TAMP_EVT_PKA_RAM_REG    PKA Register TAMP Event flag
  *            @arg @ref HAL_CCB_TAMP_EVT_PKA_OPR        PKA Operation TAMP Event flag
  *            @arg @ref HAL_CCB_TAMP_EVT_CCB            CCB TAMP Event flag
  * @retval uint32_t The state or value of flag.
  */
__STATIC_INLINE uint32_t HAL_CCB_GetFlag(const hal_ccb_handle_t *hccb, uint32_t flag)
{
  return (((STM32_READ_BIT(((CCB_TypeDef *)((uint32_t)hccb->instance))->SR, flag) == flag) ? 1U : 0U));
}
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros ---------------------------------------------------------------------------------------------------*/
/** @defgroup CCB_Exported_Macros HAL CCB Macros
  * @{
  */

/** @brief  Helper macro to calculate the minimum ECDSA pool buffer required size.
  * @param  modulus_size_byte Specifies the modulus size in bytes.
  * @retval The required Pool buffer size in bytes.
  */
#define HAL_CCB_ECDSA_CALC_BUFFER_SIZE(modulus_size_byte) (48U + ((modulus_size_byte) * 5U))

/** @brief  Helper macro to calculate the minimum ECC pool buffer required size.
  * @param  modulus_size_byte Specifies the modulus size in bytes.
  * @retval The required Pool buffer size in bytes.
  */
#define HAL_CCB_ECC_CALC_BUFFER_SIZE(modulus_size_byte) (52U + ((modulus_size_byte) * 2U))

/** @brief  Helper macro to calculate the minimum RSA pool buffer required size.
  * @param  modulus_size_byte Specifies the modulus size in bytes.
  * @retval The required Pool buffer size in bytes.
  */
#define HAL_CCB_RSA_CALC_BUFFER_SIZE(modulus_size_byte) (64U + ((modulus_size_byte) * 2U))
/**
  * @}
  */

/**
  * @}
  */

#endif /* CCB */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_HAL_CCB_H */
